Revit 2024 API
LightDistribution.Clone Method
 Creates a copy of the LightDistribution derived object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LightDistribution Clone()
Visual Basic
Public Function Clone As LightDistribution
Visual C++
public:
LightDistribution^ Clone()
See Also
LightDistribution Class
Autodesk.Revit.DB.Lighting Namespace